In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [13]:
index = [1, 2, 3]
names = ['Abdulaziz', 'Mohammed', 'Ahmed']
pan = pd.Series(names, index=index)
pan

1    Abdulaziz
2     Mohammed
3        Ahmed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [14]:
pan.index = [11, 12, 13]
pan

11    Abdulaziz
12     Mohammed
13        Ahmed
dtype: object

## Q3: Retrieve First and second elements.

In [15]:
pan[:2]

11    Abdulaziz
12     Mohammed
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [16]:
pan2 = pd.Series({14: 'Mohammed'})
pan = pan.append(pan2)
pan

11    Abdulaziz
12     Mohammed
13        Ahmed
14     Mohammed
dtype: object

In [17]:
pan.drop_duplicates()

11    Abdulaziz
12     Mohammed
13        Ahmed
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [20]:
 data = {'Name': ['Sara', 'Noura', 'Khalid'],
        'ID': [100, 200, 300],
       }

StudentsDF = pd.DataFrame(data, columns=['Name', 'ID',])
StudentsDF

     Name   ID
0    Sara  100
1   Noura  200
2  Khalid  300

## Q6: Read educ_figdp_1_Data.csv file

In [21]:
educ = pd.read_csv('educ_figdp_1_Data.csv')
educ

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [22]:
data = {'Name': ['Sara', 'Noura', 'Khalid'],
        'ID': [100, 200, 300],
       }

StudentsDF = pd.DataFrame(data, columns=['Name', 'ID',])
StudentsDF

     Name   ID
0    Sara  100
1   Noura  200
2  Khalid  300

In [28]:
StudentsDF[ :1 ]

   Name   ID
0  Sara  100

In [29]:
StudentsDF.loc[:1]

    Name   ID
0   Sara  100
1  Noura  200

In [ ]:
#The deffirent between them is slicing do not print the last element on the other hand loc does.